[Killed] BlockStatement
src/components/Cart.jsx:6:27
 import { calculateCartTotals } from '../utils/getDiscount.js';
 
 
-export const Cart = () => {
-  const { cart } = useCart();
-    const itemCount = cart.reduce((acc, item) => acc + item.quantity, 0)
-  const bestPrice = calculateCartTotals(cart);
-  const { subtotal,discount, total} = bestPrice 
-
-  return (
-    <div className="cart-container">
-      {cart.length > 0 ? (
-        <>
-          <h2 data-testid="item-count">Your Cart has ({itemCount}) items</h2>
-          <h2>Total Amount without discount - {subtotal}</h2>
-          <h2>Total Amount with discount - {total}</h2>
-          <h2>Discounted Amount - {discount}</h2>
-
-          {cart.map(item => (
-            <p  data-testid={`item-${item.id}`} key={item.id}>{item.title} x {item.quantity} - {item.price * item.quantity} {CURRENCY}</p>
-          ))}
-        </>
-      ) : 'No items found'}
-    </div>
-  );
-};
+export const Cart = () => {};
 
killedBy: Card component shows empty message when cart has no items
statusReason: Unable to find an element with the text: /no items found/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Timeout] ArrowFunction
src/components/Cart.jsx:8:35
 
 export const Cart = () => {
   const { cart } = useCart();
-    const itemCount = cart.reduce((acc, item) => acc + item.quantity, 0)
+    const itemCount = cart.reduce(() => undefined, 0)
   const bestPrice = calculateCartTotals(cart);
   const { subtotal,discount, total} = bestPrice 

[Timeout] ArithmeticOperator
src/components/Cart.jsx:8:50
 
 export const Cart = () => {
   const { cart } = useCart();
-    const itemCount = cart.reduce((acc, item) => acc + item.quantity, 0)
+    const itemCount = cart.reduce((acc, item) => acc - item.quantity, 0)
   const bestPrice = calculateCartTotals(cart);
   const { subtotal,discount, total} = bestPrice 

[Killed] EqualityOperator
src/components/Cart.jsx:14:8
 
   return (
     <div className="cart-container">
-      {cart.length > 0 ? (
+      {cart.length >= 0 ? (
         <>
           <h2 data-testid="item-count">Your Cart has ({itemCount}) items</h2>
killedBy: Card component shows empty message when cart has no items
statusReason: Unable to find an element with the text: /no items found/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ConditionalExpression
src/components/Cart.jsx:14:8
 
   return (
     <div className="cart-container">
-      {cart.length > 0 ? (
+      {false ? (
         <>
           <h2 data-testid="item-count">Your Cart has ({itemCount}) items</h2>
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Book A x 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArrowFunction
src/components/Cart.jsx:21:21
           <h2>Total Amount with discount - {total}</h2>
           <h2>Discounted Amount - {discount}</h2>
 
-          {cart.map(item => (
-            <p  data-testid={`item-${item.id}`} key={item.id}>{item.title} x {item.quantity} - {item.price * item.quantity} {CURRENCY}</p>
-          ))}
+          {cart.map(() => undefined)}
         </>
       ) : 'No items found'}
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Book A x 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Timeout] ArithmeticOperator
src/components/Cart.jsx:22:97
           <h2>Discounted Amount - {discount}</h2>
 
           {cart.map(item => (
-            <p  data-testid={`item-${item.id}`} key={item.id}>{item.title} x {item.quantity} - {item.price * item.quantity} {CURRENCY}</p>
+            <p  data-testid={`item-${item.id}`} key={item.id}>{item.title} x {item.quantity} - {item.price / item.quantity} {CURRENCY}</p>
           ))}
         </>
