[Killed] BlockStatement
src/components/BookList.jsx:5:31
 import { products } from '../common/constant.js';
 import { CURRENCY } from '../common/constant.js';
 
-export const BookList = () => {
-  const { addToCart } = useCart();
-  return (
-    <div>
-      {products.map(p => (
-        <div key={p.id} className="product-card">
-          <h3>{p.title} - {p.price} {CURRENCY}</h3>
-          <button onClick={() => addToCart(p)}>Add to Cart</button>
-        </div>
-      ))}
-    </div>
-  );
-};
+export const BookList = () => {};
 
killedBy: BookList component is exportable and renders without crashing
statusReason: Unable to find an element with the text: /Clean Code - 50 EUR/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/BookList.jsx:9:21
   const { addToCart } = useCart();
   return (
     <div>
-      {products.map(p => (
-        <div key={p.id} className="product-card">
-          <h3>{p.title} - {p.price} {CURRENCY}</h3>
-          <button onClick={() => addToCart(p)}>Add to Cart</button>
-        </div>
-      ))}
+      {products.map(() => undefined)}
     </div>
   );
killedBy: BookList component is exportable and renders without crashing
statusReason: Unable to find an element with the text: /Clean Code - 50 EUR/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div />
  </div>
</body>

[Killed] ArrowFunction
src/components/BookList.jsx:12:28
       {products.map(p => (
         <div key={p.id} className="product-card">
           <h3>{p.title} - {p.price} {CURRENCY}</h3>
-          <button onClick={() => addToCart(p)}>Add to Cart</button>
+          <button onClick={() => undefined}>Add to Cart</button>
         </div>
       ))}
killedBy: BookList component is exportable and renders without crashing
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
