[Killed] BlockStatement
src/context/CardContext.jsx:5:47
 
 const CartContext = createContext();
 
-export const CartProvider = ({ children }) => {
-  const [cart, setCart] = useState([]);
-
-  const addToCart = (product) => {
-    setCart((prevCart) => {
-      const existingItem = prevCart.find(item => item.id === product.id);
-      if (existingItem) {
-        return prevCart.map(item =>
-          item.id === product.id ? { ...item, quantity: item.quantity + 1 } : item
-        );
-      }
-      return [...prevCart, { ...product, quantity: 1 }];
-    });
-  };
-
-  return (
-    <CartContext.Provider value={{ cart, addToCart }}>
-      {children}
-    </CartContext.Provider>
-  );
-};
+export const CartProvider = ({ children }) => {};
 
 export const useCart = () => useContext(CartContext);
killedBy: CartContext provides an empty initial cart
statusReason: Unable to find an element with the text: /no items found/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/context/CardContext.jsx:8:34
 export const CartProvider = ({ children }) => {
   const [cart, setCart] = useState([]);
 
-  const addToCart = (product) => {
-    setCart((prevCart) => {
-      const existingItem = prevCart.find(item => item.id === product.id);
-      if (existingItem) {
-        return prevCart.map(item =>
-          item.id === product.id ? { ...item, quantity: item.quantity + 1 } : item
-        );
-      }
-      return [...prevCart, { ...product, quantity: 1 }];
-    });
-  };
+  const addToCart = (product) => {};
 
   return (
killedBy: CartContext adds a new Book to the cart
statusReason: Unable to find an element by: [data-testid="item-count"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="app-container"
    >

[Killed] BlockStatement
src/context/CardContext.jsx:9:27
   const [cart, setCart] = useState([]);
 
   const addToCart = (product) => {
-    setCart((prevCart) => {
-      const existingItem = prevCart.find(item => item.id === product.id);
-      if (existingItem) {
-        return prevCart.map(item =>
-          item.id === product.id ? { ...item, quantity: item.quantity + 1 } : item
-        );
-      }
-      return [...prevCart, { ...product, quantity: 1 }];
-    });
+    setCart((prevCart) => {});
   };
 
killedBy: CartContext adds a new Book to the cart
statusReason: Cannot read properties of undefined (reading 'reduce')

[Killed] ArrowFunction
src/context/CardContext.jsx:10:42
 
   const addToCart = (product) => {
     setCart((prevCart) => {
-      const existingItem = prevCart.find(item => item.id === product.id);
+      const existingItem = prevCart.find(() => undefined);
       if (existingItem) {
         return prevCart.map(item =>
killedBy: CartContext increments quantity if the Book already exists in the cart
statusReason: Found multiple elements by: [data-testid="item-1"]

Here are the matching elements:

Ignored nodes: comments, script, style
<p
  data-testid="item-1"
>

[Killed] ConditionalExpression
src/context/CardContext.jsx:10:50
 
   const addToCart = (product) => {
     setCart((prevCart) => {
-      const existingItem = prevCart.find(item => item.id === product.id);
+      const existingItem = prevCart.find(item => true);
       if (existingItem) {
         return prevCart.map(item =>
killedBy: CartContext adds multiple different Books
statusReason: expected 'Your Cart has (1) items' to be 'Your Cart has (4) items' // Object.is equality

[Killed] ConditionalExpression
src/context/CardContext.jsx:11:11
   const addToCart = (product) => {
     setCart((prevCart) => {
       const existingItem = prevCart.find(item => item.id === product.id);
-      if (existingItem) {
+      if (true) {
         return prevCart.map(item =>
           item.id === product.id ? { ...item, quantity: item.quantity + 1 } : item
killedBy: CartContext adds a new Book to the cart
statusReason: Unable to find an element by: [data-testid="item-count"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="app-container"
    >

[Killed] BlockStatement
src/context/CardContext.jsx:11:25
   const addToCart = (product) => {
     setCart((prevCart) => {
       const existingItem = prevCart.find(item => item.id === product.id);
-      if (existingItem) {
-        return prevCart.map(item =>
-          item.id === product.id ? { ...item, quantity: item.quantity + 1 } : item
-        );
-      }
+      if (existingItem) {}
       return [...prevCart, { ...product, quantity: 1 }];
     });
killedBy: CartContext increments quantity if the Book already exists in the cart
statusReason: Found multiple elements by: [data-testid="item-1"]

Here are the matching elements:

Ignored nodes: comments, script, style
<p
  data-testid="item-1"
>

[Killed] ArrowFunction
src/context/CardContext.jsx:12:29
     setCart((prevCart) => {
       const existingItem = prevCart.find(item => item.id === product.id);
       if (existingItem) {
-        return prevCart.map(item =>
-          item.id === product.id ? { ...item, quantity: item.quantity + 1 } : item
+        return prevCart.map(() => undefined
         );
       }
killedBy: CartContext increments quantity if the Book already exists in the cart
statusReason: Cannot read properties of undefined (reading 'quantity')

[Killed] ConditionalExpression
src/context/CardContext.jsx:13:11
       const existingItem = prevCart.find(item => item.id === product.id);
       if (existingItem) {
         return prevCart.map(item =>
-          item.id === product.id ? { ...item, quantity: item.quantity + 1 } : item
+          true ? { ...item, quantity: item.quantity + 1 } : item
         );
       }
killedBy: CartContext adds multiple different Books
statusReason: expected 'Your Cart has (6) items' to be 'Your Cart has (4) items' // Object.is equality

[Killed] ArithmeticOperator
src/context/CardContext.jsx:13:57
       const existingItem = prevCart.find(item => item.id === product.id);
       if (existingItem) {
         return prevCart.map(item =>
-          item.id === product.id ? { ...item, quantity: item.quantity + 1 } : item
+          item.id === product.id ? { ...item, quantity: item.quantity - 1 } : item
         );
       }
killedBy: CartContext increments quantity if the Book already exists in the cart
statusReason: expected 'Your Cart has (0) items' to be 'Your Cart has (2) items' // Object.is equality

[Killed] ObjectLiteral
src/context/CardContext.jsx:16:28
           item.id === product.id ? { ...item, quantity: item.quantity + 1 } : item
         );
       }
-      return [...prevCart, { ...product, quantity: 1 }];
+      return [...prevCart, {}];
     });
   };
killedBy: CartContext adds a new Book to the cart
statusReason: expected 'Your Cart has (NaN) items' to be 'Your Cart has (1) items' // Object.is equality

[Killed] ObjectLiteral
src/context/CardContext.jsx:21:34
   };
 
   return (
-    <CartContext.Provider value={{ cart, addToCart }}>
+    <CartContext.Provider value={{}}>
       {children}
     </CartContext.Provider>
killedBy: CartContext provides an empty initial cart
statusReason: Cannot read properties of undefined (reading 'reduce')

[Killed] ArrowFunction
src/context/CardContext.jsx:27:24
   );
 };
 
-export const useCart = () => useContext(CartContext);
+export const useCart = () => undefined;
 
killedBy: CartContext provides an empty initial cart
statusReason: Cannot destructure property 'addToCart' of '(0 , __vite_ssr_import_1__.useCart)(...)' as it is undefined.
