[Timeout] BlockStatement
src/utils/getDiscount.js:1:42
-export const getDiscountRate = (size) => {
-  if (size >= 5) return 25; // percent
-  if (size === 4) return 20;
-  if (size === 3) return 10;
-  if (size === 2) return 5;
-  return 0;
-};
+export const getDiscountRate = (size) => {};
 
 const makeSubsets = (n) =>

[Killed] EqualityOperator
src/utils/getDiscount.js:2:7
 export const getDiscountRate = (size) => {
-  if (size >= 5) return 25; // percent
+  if (size < 5) return 25; // percent
   if (size === 4) return 20;
   if (size === 3) return 10;
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Timeout] ConditionalExpression
src/utils/getDiscount.js:2:7
 export const getDiscountRate = (size) => {
-  if (size >= 5) return 25; // percent
+  if (true) return 25; // percent
   if (size === 4) return 20;
   if (size === 3) return 10;

[Timeout] ConditionalExpression
src/utils/getDiscount.js:3:7
 export const getDiscountRate = (size) => {
   if (size >= 5) return 25; // percent
-  if (size === 4) return 20;
+  if (true) return 20;
   if (size === 3) return 10;
   if (size === 2) return 5;

[Timeout] ConditionalExpression
src/utils/getDiscount.js:3:7
 export const getDiscountRate = (size) => {
   if (size >= 5) return 25; // percent
-  if (size === 4) return 20;
+  if (false) return 20;
   if (size === 3) return 10;
   if (size === 2) return 5;

[Killed] EqualityOperator
src/utils/getDiscount.js:4:7
 export const getDiscountRate = (size) => {
   if (size >= 5) return 25; // percent
   if (size === 4) return 20;
-  if (size === 3) return 10;
+  if (size !== 3) return 10;
   if (size === 2) return 5;
   return 0;
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Timeout] ConditionalExpression
src/utils/getDiscount.js:4:7
 export const getDiscountRate = (size) => {
   if (size >= 5) return 25; // percent
   if (size === 4) return 20;
-  if (size === 3) return 10;
+  if (true) return 10;
   if (size === 2) return 5;
   return 0;

[Killed] ConditionalExpression
src/utils/getDiscount.js:5:7
   if (size >= 5) return 25; // percent
   if (size === 4) return 20;
   if (size === 3) return 10;
-  if (size === 2) return 5;
+  if (false) return 5;
   return 0;
 };
killedBy: Card component computes optimal grouping and shows breakdown for example cart
statusReason: Unable to find an element with the text: /Discounted Amount - 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ConditionalExpression
src/utils/getDiscount.js:5:7
   if (size >= 5) return 25; // percent
   if (size === 4) return 20;
   if (size === 3) return 10;
-  if (size === 2) return 5;
+  if (true) return 5;
   return 0;
 };
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ArrowFunction
src/utils/getDiscount.js:9:21
   return 0;
 };
 
-const makeSubsets = (n) =>
-  Array.from({ length: n }, (_, i) => i)
-    .reduce((acc, idx) => acc.concat(acc.map(s => s.concat(idx))), [[]])
-    .slice(1);
+const makeSubsets = () => undefined;
 
 const keyFrom = arr => arr.join(',');
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] MethodExpression
src/utils/getDiscount.js:10:3
 };
 
 const makeSubsets = (n) =>
-  Array.from({ length: n }, (_, i) => i)
-    .reduce((acc, idx) => acc.concat(acc.map(s => s.concat(idx))), [[]])
-    .slice(1);
+  Array.from({
+  length: n
+}, (_, i) => i).reduce((acc, idx) => acc.concat(acc.map(s => s.concat(idx))), [[]]);
 
 const keyFrom = arr => arr.join(',');
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Maximum call stack size exceeded

[Killed] ArrowFunction
src/utils/getDiscount.js:10:29
 };
 
 const makeSubsets = (n) =>
-  Array.from({ length: n }, (_, i) => i)
+  Array.from({ length: n }, () => undefined)
     .reduce((acc, idx) => acc.concat(acc.map(s => s.concat(idx))), [[]])
     .slice(1);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ArrowFunction
src/utils/getDiscount.js:11:13
 
 const makeSubsets = (n) =>
   Array.from({ length: n }, (_, i) => i)
-    .reduce((acc, idx) => acc.concat(acc.map(s => s.concat(idx))), [[]])
+    .reduce(() => undefined, [[]])
     .slice(1);
 
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] ArrowFunction
src/utils/getDiscount.js:11:46
 
 const makeSubsets = (n) =>
   Array.from({ length: n }, (_, i) => i)
-    .reduce((acc, idx) => acc.concat(acc.map(s => s.concat(idx))), [[]])
+    .reduce((acc, idx) => acc.concat(acc.map(() => undefined)), [[]])
     .slice(1);
 
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Cannot read properties of undefined (reading 'every')

[Killed] ArrowFunction
src/utils/getDiscount.js:14:17
     .reduce((acc, idx) => acc.concat(acc.map(s => s.concat(idx))), [[]])
     .slice(1);
 
-const keyFrom = arr => arr.join(',');
+const keyFrom = () => undefined;
 const allZero = arr => arr.every(c => c === 0);
 const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));
killedBy: Card component computes optimal grouping and shows breakdown for example cart
statusReason: Unable to find an element with the text: /Discounted Amount - 80/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Timeout] StringLiteral
src/utils/getDiscount.js:14:33
     .reduce((acc, idx) => acc.concat(acc.map(s => s.concat(idx))), [[]])
     .slice(1);
 
-const keyFrom = arr => arr.join(',');
+const keyFrom = arr => arr.join("");
 const allZero = arr => arr.every(c => c === 0);
 const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));

[Killed] ConditionalExpression
src/utils/getDiscount.js:15:39
     .slice(1);
 
 const keyFrom = arr => arr.join(',');
-const allZero = arr => arr.every(c => c === 0);
+const allZero = arr => arr.every(c => false);
 const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));
 const setPriceOf = (idxs, prices) => idxs.reduce((s, i) => s + prices[i], 0);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ConditionalExpression
src/utils/getDiscount.js:15:39
     .slice(1);
 
 const keyFrom = arr => arr.join(',');
-const allZero = arr => arr.every(c => c === 0);
+const allZero = arr => arr.every(c => true);
 const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));
 const setPriceOf = (idxs, prices) => idxs.reduce((s, i) => s + prices[i], 0);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ArrowFunction
src/utils/getDiscount.js:16:41
 
 const keyFrom = arr => arr.join(',');
 const allZero = arr => arr.every(c => c === 0);
-const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));
+const makeNext = (cur, idxs) => cur.map(() => undefined);
 const setPriceOf = (idxs, prices) => idxs.reduce((s, i) => s + prices[i], 0);
 const discountedPrice = (price, size) => Math.round(price * (100 - getDiscountRate(size)) / 100);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ArrowFunction
src/utils/getDiscount.js:16:18
 
 const keyFrom = arr => arr.join(',');
 const allZero = arr => arr.every(c => c === 0);
-const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));
+const makeNext = () => undefined;
 const setPriceOf = (idxs, prices) => idxs.reduce((s, i) => s + prices[i], 0);
 const discountedPrice = (price, size) => Math.round(price * (100 - getDiscountRate(size)) / 100);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Cannot read properties of undefined (reading 'join')

[Killed] ArithmeticOperator
src/utils/getDiscount.js:17:60
 const keyFrom = arr => arr.join(',');
 const allZero = arr => arr.every(c => c === 0);
 const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));
-const setPriceOf = (idxs, prices) => idxs.reduce((s, i) => s + prices[i], 0);
+const setPriceOf = (idxs, prices) => idxs.reduce((s, i) => s - prices[i], 0);
 const discountedPrice = (price, size) => Math.round(price * (100 - getDiscountRate(size)) / 100);
 
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ArrowFunction
src/utils/getDiscount.js:17:20
 const keyFrom = arr => arr.join(',');
 const allZero = arr => arr.every(c => c === 0);
 const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));
-const setPriceOf = (idxs, prices) => idxs.reduce((s, i) => s + prices[i], 0);
+const setPriceOf = () => undefined;
 const discountedPrice = (price, size) => Math.round(price * (100 - getDiscountRate(size)) / 100);
 
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ArithmeticOperator
src/utils/getDiscount.js:18:62
 const allZero = arr => arr.every(c => c === 0);
 const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));
 const setPriceOf = (idxs, prices) => idxs.reduce((s, i) => s + prices[i], 0);
-const discountedPrice = (price, size) => Math.round(price * (100 - getDiscountRate(size)) / 100);
+const discountedPrice = (price, size) => Math.round(price * (100 + getDiscountRate(size)) / 100);
 
 const computeBestPriceCents = (counts, pricesCents) => {
killedBy: Card component computes optimal grouping and shows breakdown for example cart
statusReason: Unable to find an element with the text: /Discounted Amount - 80/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArithmeticOperator
src/utils/getDiscount.js:18:53
 const allZero = arr => arr.every(c => c === 0);
 const makeNext = (cur, idxs) => cur.map((v, i) => (idxs.includes(i) ? v - 1 : v));
 const setPriceOf = (idxs, prices) => idxs.reduce((s, i) => s + prices[i], 0);
-const discountedPrice = (price, size) => Math.round(price * (100 - getDiscountRate(size)) / 100);
+const discountedPrice = (price, size) => Math.round(price / (100 - getDiscountRate(size)) / 100);
 
 const computeBestPriceCents = (counts, pricesCents) => {
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ConditionalExpression
src/utils/getDiscount.js:25:41
   const subsets = makeSubsets(counts.length);
 
   const helper = curCounts => {
-    const key = keyFrom(curCounts); if (memo.has(key)) return memo.get(key);
+    const key = keyFrom(curCounts); if (true) return memo.get(key);
     if (allZero(curCounts)) { const res = { price: 0, breakdown: {} }; memo.set(key, res); return res; }
     const best = subsets
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Cannot destructure property 'price' of 'computeBestPriceCents(...)' as it is undefined.

[Timeout] ConditionalExpression
src/utils/getDiscount.js:25:41
   const subsets = makeSubsets(counts.length);
 
   const helper = curCounts => {
-    const key = keyFrom(curCounts); if (memo.has(key)) return memo.get(key);
+    const key = keyFrom(curCounts); if (false) return memo.get(key);
     if (allZero(curCounts)) { const res = { price: 0, breakdown: {} }; memo.set(key, res); return res; }
     const best = subsets

[Killed] BlockStatement
src/utils/getDiscount.js:26:29
 
   const helper = curCounts => {
     const key = keyFrom(curCounts); if (memo.has(key)) return memo.get(key);
-    if (allZero(curCounts)) { const res = { price: 0, breakdown: {} }; memo.set(key, res); return res; }
+    if (allZero(curCounts)) {}
     const best = subsets
       .filter(idxs => idxs.every(i => curCounts[i] > 0))
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ConditionalExpression
src/utils/getDiscount.js:26:9
 
   const helper = curCounts => {
     const key = keyFrom(curCounts); if (memo.has(key)) return memo.get(key);
-    if (allZero(curCounts)) { const res = { price: 0, breakdown: {} }; memo.set(key, res); return res; }
+    if (false) { const res = { price: 0, breakdown: {} }; memo.set(key, res); return res; }
     const best = subsets
       .filter(idxs => idxs.every(i => curCounts[i] > 0))
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Timeout] MethodExpression
src/utils/getDiscount.js:27:18
   const helper = curCounts => {
     const key = keyFrom(curCounts); if (memo.has(key)) return memo.get(key);
     if (allZero(curCounts)) { const res = { price: 0, breakdown: {} }; memo.set(key, res); return res; }
-    const best = subsets
-      .filter(idxs => idxs.every(i => curCounts[i] > 0))
+    const best = subsets
       .reduce((a, b) => a.total < b.total ? a : b, { total: Infinity, breakdown: {} });

[Killed] ArrowFunction
src/utils/getDiscount.js:28:15
     const key = keyFrom(curCounts); if (memo.has(key)) return memo.get(key);
     if (allZero(curCounts)) { const res = { price: 0, breakdown: {} }; memo.set(key, res); return res; }
     const best = subsets
-      .filter(idxs => idxs.every(i => curCounts[i] > 0))
+      .filter(() => undefined)
       .reduce((a, b) => a.total < b.total ? a : b, { total: Infinity, breakdown: {} });
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ArrowFunction
src/utils/getDiscount.js:28:34
     const key = keyFrom(curCounts); if (memo.has(key)) return memo.get(key);
     if (allZero(curCounts)) { const res = { price: 0, breakdown: {} }; memo.set(key, res); return res; }
     const best = subsets
-      .filter(idxs => idxs.every(i => curCounts[i] > 0))
+      .filter(idxs => idxs.every(() => undefined))
       .reduce((a, b) => a.total < b.total ? a : b, { total: Infinity, breakdown: {} });
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ArrowFunction
src/utils/getDiscount.js:30:15
     const best = subsets
       .filter(idxs => idxs.every(i => curCounts[i] > 0))
-      .reduce((a, b) => a.total < b.total ? a : b, { total: Infinity, breakdown: {} });
+      .reduce(() => undefined, { total: Infinity, breakdown: {} });
     const out = { price: best.total, breakdown: best.breakdown }; memo.set(key, out); 
     //console.log("value f out is", out);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Cannot read properties of undefined (reading 'total')

[Killed] ConditionalExpression
src/utils/getDiscount.js:30:25
     const best = subsets
       .filter(idxs => idxs.every(i => curCounts[i] > 0))
-      .reduce((a, b) => a.total < b.total ? a : b, { total: Infinity, breakdown: {} });
+      .reduce((a, b) => true ? a : b, { total: Infinity, breakdown: {} });
     const out = { price: best.total, breakdown: best.breakdown }; memo.set(key, out); 
     //console.log("value f out is", out);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ObjectLiteral
src/utils/getDiscount.js:31:17
       .filter(idxs => idxs.every(i => curCounts[i] > 0))
       .reduce((a, b) => a.total < b.total ? a : b, { total: Infinity, breakdown: {} });
-    const out = { price: best.total, breakdown: best.breakdown }; memo.set(key, out); 
+    const out = {}; memo.set(key, out); 
     //console.log("value f out is", out);
     return out;
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2

[Killed] ArrowFunction
src/utils/getDiscount.js:40:17
   return helper(counts);
 };
 
-const toCents = price => Math.round((price) * 100);
+const toCents = () => undefined;
 const pricesCentsFrom = items => items.map(i => toCents(i.price));
 const countsFrom = items => items.map(i => i.quantity);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Total Amount without discount - 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArithmeticOperator
src/utils/getDiscount.js:40:37
   return helper(counts);
 };
 
-const toCents = price => Math.round((price) * 100);
+const toCents = price => Math.round(price / 100);
 const pricesCentsFrom = items => items.map(i => toCents(i.price));
 const countsFrom = items => items.map(i => i.quantity);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Total Amount without discount - 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArrowFunction
src/utils/getDiscount.js:41:25
 };
 
 const toCents = price => Math.round((price) * 100);
-const pricesCentsFrom = items => items.map(i => toCents(i.price));
+const pricesCentsFrom = () => undefined;
 const countsFrom = items => items.map(i => i.quantity);
 const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a + c * pricesCents[idx], 0);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
src/utils/getDiscount.js:41:44
 };
 
 const toCents = price => Math.round((price) * 100);
-const pricesCentsFrom = items => items.map(i => toCents(i.price));
+const pricesCentsFrom = items => items.map(() => undefined);
 const countsFrom = items => items.map(i => i.quantity);
 const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a + c * pricesCents[idx], 0);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Total Amount without discount - 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArrowFunction
src/utils/getDiscount.js:42:39
 
 const toCents = price => Math.round((price) * 100);
 const pricesCentsFrom = items => items.map(i => toCents(i.price));
-const countsFrom = items => items.map(i => i.quantity);
+const countsFrom = items => items.map(() => undefined);
 const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a + c * pricesCents[idx], 0);
 const toEuros = cents => Number((cents / 100).toFixed(2));
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Total Amount without discount - 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArrowFunction
src/utils/getDiscount.js:42:20
 
 const toCents = price => Math.round((price) * 100);
 const pricesCentsFrom = items => items.map(i => toCents(i.price));
-const countsFrom = items => items.map(i => i.quantity);
+const countsFrom = () => undefined;
 const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a + c * pricesCents[idx], 0);
 const toEuros = cents => Number((cents / 100).toFixed(2));
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Cannot read properties of undefined (reading 'reduce')

[Killed] ArithmeticOperator
src/utils/getDiscount.js:43:79
 const toCents = price => Math.round((price) * 100);
 const pricesCentsFrom = items => items.map(i => toCents(i.price));
 const countsFrom = items => items.map(i => i.quantity);
-const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a + c * pricesCents[idx], 0);
+const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a - c * pricesCents[idx], 0);
 const toEuros = cents => Number((cents / 100).toFixed(2));
 
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Total Amount without discount - 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArrowFunction
src/utils/getDiscount.js:43:25
 const toCents = price => Math.round((price) * 100);
 const pricesCentsFrom = items => items.map(i => toCents(i.price));
 const countsFrom = items => items.map(i => i.quantity);
-const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a + c * pricesCents[idx], 0);
+const subtotalCentsOf = () => undefined;
 const toEuros = cents => Number((cents / 100).toFixed(2));
 
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Total Amount without discount - 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArithmeticOperator
src/utils/getDiscount.js:44:34
 const pricesCentsFrom = items => items.map(i => toCents(i.price));
 const countsFrom = items => items.map(i => i.quantity);
 const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a + c * pricesCents[idx], 0);
-const toEuros = cents => Number((cents / 100).toFixed(2));
+const toEuros = cents => Number((cents * 100).toFixed(2));
 
 export const calculateCartTotals = (items) => {
killedBy: Card component computes optimal grouping and shows breakdown for example cart
statusReason: Unable to find an element with the text: /Discounted Amount - 62.5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArrowFunction
src/utils/getDiscount.js:44:17
 const pricesCentsFrom = items => items.map(i => toCents(i.price));
 const countsFrom = items => items.map(i => i.quantity);
 const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a + c * pricesCents[idx], 0);
-const toEuros = cents => Number((cents / 100).toFixed(2));
+const toEuros = () => undefined;
 
 export const calculateCartTotals = (items) => {
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Total Amount without discount - 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] BlockStatement
src/utils/getDiscount.js:46:47
 const subtotalCentsOf = (counts, pricesCents) => counts.reduce((a, c, idx) => a + c * pricesCents[idx], 0);
 const toEuros = cents => Number((cents / 100).toFixed(2));
 
-export const calculateCartTotals = (items) => {
-  if (items.length === 0) return { subtotal: 0, discount: 0, total: 0, breakdown: {} };
-  const pricesCents = pricesCentsFrom(items);
-  const counts = countsFrom(items);
-  const subtotalCents = subtotalCentsOf(counts, pricesCents);
-  const { price: bestPriceCents, breakdown } = computeBestPriceCents(counts, pricesCents);
-  const discountCents = subtotalCents - bestPriceCents;
-  return { subtotal: toEuros(subtotalCents), discount: toEuros(discountCents), total: toEuros(bestPriceCents), breakdown };
-};
+export const calculateCartTotals = (items) => {};
killedBy: Card component shows empty message when cart has no items
statusReason: Cannot destructure property 'subtotal' of 'bestPrice' as it is undefined.

[Killed] ConditionalExpression
src/utils/getDiscount.js:47:7
 const toEuros = cents => Number((cents / 100).toFixed(2));
 
 export const calculateCartTotals = (items) => {
-  if (items.length === 0) return { subtotal: 0, discount: 0, total: 0, breakdown: {} };
+  if (true) return { subtotal: 0, discount: 0, total: 0, breakdown: {} };
   const pricesCents = pricesCentsFrom(items);
   const counts = countsFrom(items);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Total Amount without discount - 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >
