[Killed] EqualityOperator
src/utils/getDiscount.js:47:7
 const toEuros = cents => Number((cents / 100).toFixed(2));
 
 export const calculateCartTotals = (items) => {
-  if (items.length === 0) return { subtotal: 0, discount: 0, total: 0, breakdown: {} };
+  if (items.length !== 0) return { subtotal: 0, discount: 0, total: 0, breakdown: {} };
   const pricesCents = pricesCentsFrom(items);
   const counts = countsFrom(items);
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an element with the text: /Total Amount without discount - 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="cart-container"
    >

[Killed] ArithmeticOperator
src/utils/getDiscount.js:52:25
   const counts = countsFrom(items);
   const subtotalCents = subtotalCentsOf(counts, pricesCents);
   const { price: bestPriceCents, breakdown } = computeBestPriceCents(counts, pricesCents);
-  const discountCents = subtotalCents - bestPriceCents;
+  const discountCents = subtotalCents + bestPriceCents;
   return { subtotal: toEuros(subtotalCents), discount: toEuros(discountCents), total: toEuros(bestPriceCents), breakdown };
 };
killedBy: Card component renders a single item and correct totals with no discount
statusReason: Unable to find an accessible element with the role "heading" and name `/discounted amount - 0/i`

Here are the accessible roles:

  heading:

  Name "Your Cart has (1) items":
  <h2
