[Timeout] BlockStatement
src/setupTests.js:6:17
 import '@testing-library/jest-dom/vitest';
 
 // Automatically clean up the DOM after each test case
-afterEach(() => {
-  cleanup();
-});
+afterEach(() => {});
 
