[Killed] ObjectLiteral
src/common/constant.js:2:3
 export const products = [
-  { id: 1,title: 'Clean Code', price: 50 },
+  {},
   { id: 2, title: 'The Clean Coder', price: 50 },
   { id: 3, title: 'Clean Architecture', price: 50 },
killedBy: BookList component is exportable and renders without crashing
statusReason: Unable to find an element with the text: /Clean Code - 50 EUR/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="product-card"

[Timeout] StringLiteral
src/common/constant.js:3:19
 export const products = [
   { id: 1,title: 'Clean Code', price: 50 },
-  { id: 2, title: 'The Clean Coder', price: 50 },
+  { id: 2, title: "", price: 50 },
   { id: 3, title: 'Clean Architecture', price: 50 },
 { id: 4, title: 'Test Driven Development by Example', price: 50 },

[Timeout] ObjectLiteral
src/common/constant.js:5:1
   { id: 1,title: 'Clean Code', price: 50 },
   { id: 2, title: 'The Clean Coder', price: 50 },
   { id: 3, title: 'Clean Architecture', price: 50 },
-{ id: 4, title: 'Test Driven Development by Example', price: 50 },
+{},
   { id: 5, title: 'Working Effectively With Legacy Code', price: 50 },
 ];
